In [ ]:
import pandas as pd
import numpy as np

In [ ]:
Empleados=pd.read_csv("https://raw.githubusercontent.com/AlcidesOxa/datos/master/ejemplo.csv",sep=';',encoding="ISO-8859-1")
Empleados.head()

         Nombres         Apellidos    Sexo  ...  Fecha contrato  Faltas  Permisos
0  Pablo Enrique  Barrientos Gómez  Hombre  ...        6/5/2010     1.0       NaN
1  Teresa Marina  Bracamonte Palma   Mujer  ...             NaN     NaN       2.0
2        Vicente     Cardoso Zerda  Hombre  ...       18/4/2009     NaN       NaN
3      Juan José          Ceballos  Hombre  ...             NaN     NaN       NaN
4    Raúl Sergio   Claros Gonzáles  Hombre  ...       12/8/2017     NaN       1.0

[5 rows x 12 columns]

In [ ]:
cambio={'Años estudio':'Anios_estudio', 'Estado Civil':'Estado_civil', 'Satisfacción Trabajo':'Satisfaccion_trabajo', 'Fecha contrato':'Fecha_contrato'}
Empleados.rename(columns=cambio,inplace=True)
casosborrar=[3,5,8]
Empleados=Empleados.drop(casosborrar)
varborrar=['Faltas','Permisos']
Empleados=Empleados.drop(varborrar,axis=1)
varcategoricas=['Sexo','Estado_civil','Satisfaccion_trabajo']
Empleados[varcategoricas]=Empleados[varcategoricas].fillna('Desconocido')
Empleados[varcategoricas]=Empleados[varcategoricas].astype('category')
Empleados['Fecha_contrato']=pd.to_datetime(Empleados.Fecha_contrato)
orden_ec=Empleados.Estado_civil.cat.categories.values[[3,0,2,4,1]].tolist()
orden_st=Empleados.Satisfaccion_trabajo.cat.categories.values[[2,3,0,1]].tolist()
Empleados.Estado_civil=Empleados.Estado_civil.cat.reorder_categories(orden_ec)
Empleados.Satisfaccion_trabajo=Empleados.Satisfaccion_trabajo.cat.reorder_categories(orden_st)
Empleados['Satisfaccion_trabajo']=Empleados.Satisfaccion_trabajo.cat.rename_categories(
    ['Insatisfecho(a)','Neutral','Satisfecho(a)','Desconocido'])
Empleados['Experiencia_lab']=Empleados.Edad-Empleados.Anios_estudio-5
Empleados['Balance']=Empleados.Ingresos-Empleados.Gastos

Obtener las frecuencias absolutas y relativas de Satisfacción

In [ ]:
Empleados.Satisfaccion_trabajo.value_counts()

Insatisfecho(a)    9
Neutral            8
Satisfecho(a)      6
Desconocido        4
Name: Satisfaccion_trabajo, dtype: int64

In [ ]:
Empleados.Satisfaccion_trabajo.value_counts(normalize=True)

Insatisfecho(a)    0.333333
Neutral            0.296296
Satisfecho(a)      0.222222
Desconocido        0.148148
Name: Satisfaccion_trabajo, dtype: float64

Crear las Tablas cruzadas de sexo y satisfacción con frecuencias conjuntas absolutas, relativas, condicionales por fila y por columna

In [ ]:
pd.crosstab(Empleados.Sexo, Empleados.Satisfaccion_trabajo, margins=True, margins_name='Total')

Satisfaccion_trabajo  Insatisfecho(a)  Neutral  ...  Desconocido  Total
Sexo                                            ...
Hombre                              6        4  ...            3     16
Mujer                               3        4  ...            1     11
Total                               9        8  ...            4     27

[3 rows x 5 columns]

In [ ]:
pd.crosstab(Empleados.Sexo, Empleados.Satisfaccion_trabajo, margins=True, margins_name='Total', normalize=True)

Satisfaccion_trabajo  Insatisfecho(a)   Neutral  ...  Desconocido     Total
Sexo                                             ...
Hombre                       0.222222  0.148148  ...     0.111111  0.592593
Mujer                        0.111111  0.148148  ...     0.037037  0.407407
Total                        0.333333  0.296296  ...     0.148148  1.000000

[3 rows x 5 columns]

In [ ]:
pd.crosstab(Empleados.Sexo, Empleados.Satisfaccion_trabajo, margins=True, margins_name='Total', normalize='columns')

Satisfaccion_trabajo  Insatisfecho(a)  Neutral  ...  Desconocido     Total
Sexo                                            ...
Hombre                       0.666667      0.5  ...         0.75  0.592593
Mujer                        0.333333      0.5  ...         0.25  0.407407

[2 rows x 5 columns]

In [ ]:
pd.crosstab(Empleados.Sexo, Empleados.Satisfaccion_trabajo, margins=True, margins_name='Total', normalize='index')

Satisfaccion_trabajo  Insatisfecho(a)   Neutral  Satisfecho(a)  Desconocido
Sexo
Hombre                       0.375000  0.250000       0.187500     0.187500
Mujer                        0.272727  0.363636       0.272727     0.090909
Total                        0.333333  0.296296       0.222222     0.148148

Obtener el vector de medias de gastos, ingresos y balance

In [ ]:
varbls = ['Gastos', 'Ingresos', 'Balance']
Empleados[varbls].mean()

Gastos      6409.807692
Ingresos    7541.576923
Balance     1131.769231
dtype: float64

Obtener los vectores de deciles 1 3 5 7 y 9 de gastos, ingresos y balance

In [ ]:
decs = np.arange(1, 10, 2)/10
Empleados[varbls].quantile(decs)

     Gastos  Ingresos  Balance
0.1  3363.0    3303.5  -1317.0
0.3  5097.5    4099.0   -354.5
0.5  6117.5    7360.0    944.5
0.7  7900.0   10805.5   2568.5
0.9  9369.5   11848.5   3301.0

Obtener las desviaciones estándar de gastos, ingresos y balance

In [ ]:
Empleados[varbls].mean()

Gastos      6409.807692
Ingresos    7541.576923
Balance     1131.769231
dtype: float64

Obtener la matriz de correlaciones de gastos, ingresos y balance

In [ ]:
Empleados[varbls].corr()

            Gastos  Ingresos   Balance
Gastos    1.000000  0.879145  0.444497
Ingresos  0.879145  1.000000  0.817665
Balance   0.444497  0.817665  1.000000

# **PARTE 2**

Calcular el índice de Shannon de años de estudio y experiencia laboral ¿cuál tiene mayor diversidad?

In [ ]:
Empleados[['Anios_estudio','Experiencia_lab']].apply(lambda x:-np.sum(x/np.sum(x)*np.log(x/np.sum(x))))

Anios_estudio      3.131271
Experiencia_lab    3.039474
dtype: float64

Los años de estudio tienen más diversidad

Obtener el mínimo y el máximo por filas de las variables cuantitativas

In [ ]:
var_cuant = Empleados.select_dtypes(np.number).columns.values
Empleados[var_cuant].apply(['min', 'max'], axis = 1)

       min      max
0      5.0   3662.0
1     23.0     23.0
2   -117.0   4180.0
4     20.0  15479.0
6      7.0   7553.0
7      5.0  11612.0
9  -1046.0   5181.0
10    56.0   2117.0
11    14.0   7535.0
12 -1634.0   3771.0
13    17.0  12085.0
14  -592.0   6174.0
15    13.0  11112.0
16 -1494.0   5477.0
17    17.0   9351.0
18  -694.0   7461.0
19 -1140.0   4913.0
20    16.0  10935.0
21  -854.0   6061.0
22    17.0  11467.0
23     9.0  10892.0
24     6.0   2967.0
25    17.0  10719.0
26    19.0  13491.0
27    13.0   7185.0
28     8.0   8632.0
29 -1888.0   5528.0

Obtener las medianas por satisfacción, de la edad, años de estudio y experiencia

In [ ]:
lista = ['Satisfaccion_trabajo', 'Anios_estudio', 'Edad', 'Experiencia_lab']
Empleados[lista].groupby('Satisfaccion_trabajo').median()

                      Anios_estudio  Edad  Experiencia_lab
Satisfaccion_trabajo
Insatisfecho(a)                14.0  39.0             18.0
Neutral                        15.0  42.5             23.5
Satisfecho(a)                  18.5  42.0             23.5
Desconocido                    14.0  55.0             45.0

Obtener las matrices de correlación por satisfacción, de la edad, años de estudio y experiencia

In [ ]:
Empleados[lista].groupby('Satisfaccion_trabajo').corr()

                                      Anios_estudio      Edad  Experiencia_lab
Satisfaccion_trabajo
Insatisfecho(a)      Anios_estudio         1.000000 -0.169761        -0.634709
                     Edad                 -0.169761  1.000000         0.869284
                     Experiencia_lab      -0.634709  0.869284         1.000000
Neutral              Anios_estudio         1.000000  0.190971        -0.312963
                     Edad                  0.190971  1.000000         0.872519
                     Experiencia_lab      -0.312963  0.872519         1.000000
Satisfecho(a)        Anios_estudio         1.000000 -0.075167        -0.334560
                     Edad                 -0.075167  1.000000         0.964856
                     Experiencia_lab      -0.334560  0.964856         1.000000
Desconocido          Anios_estudio         1.000000       NaN              NaN
                     Edad                       NaN  1.000000              NaN
                     Experiencia_lab            NaN       NaN              NaN

Obtener los mínimos y máximos por sexo y satisfacción, de la edad, años de estudio y experiencia

In [ ]:
pd.crosstab(Empleados.Satisfaccion_trabajo, Empleados.Sexo, values=Empleados.Edad, aggfunc=['min', 'max'])

                        min          max
Sexo                 Hombre Mujer Hombre Mujer
Satisfaccion_trabajo
Insatisfecho(a)        26.0  30.0   58.0  46.0
Neutral                38.0  27.0   53.0  47.0
Satisfecho(a)          41.0  35.0   67.0  43.0
Desconocido            37.0   NaN   56.0   NaN

In [ ]:
pd.crosstab(Empleados.Satisfaccion_trabajo, Empleados.Sexo, values=Empleados.Anios_estudio, aggfunc=['min', 'max'])

                        min          max
Sexo                 Hombre Mujer Hombre Mujer
Satisfaccion_trabajo
Insatisfecho(a)         6.0   6.0   17.0  23.0
Neutral                 5.0   6.0   19.0  19.0
Satisfecho(a)          14.0  13.0   20.0  21.0
Desconocido             5.0  23.0    5.0  23.0

In [ ]:
pd.crosstab(Empleados.Satisfaccion_trabajo, Empleados.Sexo, values=Empleados.Experiencia_lab, aggfunc=['min', 'max'])

                        min          max
Sexo                 Hombre Mujer Hombre Mujer
Satisfaccion_trabajo
Insatisfecho(a)        10.0   5.0   37.0  35.0
Neutral                22.0   8.0   43.0  25.0
Satisfecho(a)          22.0   9.0   45.0  25.0
Desconocido            45.0   NaN   45.0   NaN